gptoss_120b_fp4_geomean/runs/gptoss_8k1k_c32_new/docker.log
[GPU Monitor] Started AMD (PID=19, interval=1s, output=/workspace/gpu_metrics.csv)
+ SERVER_PID=20
+ wait_for_server_ready --port 19000 --server-log /workspace/server.log --server-pid 20
+ set +x
+ vllm serve /dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a --port 19000 --attention-backend ROCM_AITER_UNIFIED_ATTN -cc.pass_config.fuse_rope_kvcache=True -cc.use_inductor_graph_partition=True --tensor-parallel-size=1 --gpu-memory-utilization 0.95 --max-model-len 9416 --block-size=64 --no-enable-prefix-caching
(APIServer pid=20) INFO 07-07 18:57:00 [utils.py:344] 
(APIServer pid=20) INFO 07-07 18:57:00 [utils.py:344]        █     █     █▄   ▄█
(APIServer pid=20) INFO 07-07 18:57:00 [utils.py:344]  ▄▄ ▄█ █     █     █ ▀▄▀ █  version 0.22.0
(APIServer pid=20) INFO 07-07 18:57:00 [utils.py:344]   █▄█▀ █     █     █     █  model   /dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a
(APIServer pid=20) INFO 07-07 18:57:00 [utils.py:344]    ▀▀  ▀▀▀▀▀ ▀▀▀▀▀ ▀     ▀
(APIServer pid=20) INFO 07-07 18:57:00 [utils.py:344] 
(APIServer pid=20) INFO 07-07 18:57:00 [utils.py:278] non-default args: {'model_tag': '/dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a', 'port': 19000, 'model': '/dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a', 'max_model_len': 9416, 'attention_backend': 'ROCM_AITER_UNIFIED_ATTN', 'block_size': 64, 'gpu_memory_utilization': 0.95, 'enable_prefix_caching': False, 'compilation_config': {'mode': None, 'debug_dump_path': None, 'cache_dir': '', 'compile_cache_save_format': 'binary', 'backend': 'inductor', 'custom_ops': ['+rotary_embedding'], 'ir_enable_torch_wrap': None, 'splitting_ops': None, 'compile_mm_encoder': False, 'cudagraph_mm_encoder': False, 'encoder_cudagraph_token_budgets': [], 'encoder_cudagraph_max_vision_items_per_batch': 0, 'encoder_cudagraph_max_frames_per_batch': None, 'compile_sizes': None, 'compile_ranges_endpoints': None, 'inductor_compile_config': {'enable_auto_functionalized_v2': False, 'size_asserts': False, 'alignment_asserts': False, 'scalar_asserts': False, 'combo_kernels': True, 'benchmark_combo_kernel': True}, 'inductor_passes': {}, 'cudagraph_mode': None, 'cudagraph_num_of_warmups': 0, 'cudagraph_capture_sizes': None, 'cudagraph_copy_inputs': False, 'cudagraph_specialize_lora': True, 'use_inductor_graph_partition': True, 'pass_config': {'fuse_rope_kvcache': True}, 'max_cudagraph_capture_size': None, 'dynamic_shapes_config': {'type': <DynamicShapesType.BACKED: 'backed'>, 'evaluate_guards': False, 'assume_32_bit_indexing': False}, 'local_cache_dir': None, 'fast_moe_cold_start': None, 'static_all_moe_layers': []}}
(APIServer pid=20) INFO 07-07 18:57:13 [model.py:617] Resolved architecture: GptOssForCausalLM
(APIServer pid=20) INFO 07-07 18:57:13 [model.py:1752] Using max model len 9416
(APIServer pid=20) [aiter] import [module_aiter_core] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_aiter_core.so
(APIServer pid=20) INFO 07-07 18:57:15 [scheduler.py:239] Chunked prefill is enabled with max_num_batched_tokens=8192.
(APIServer pid=20) INFO 07-07 18:57:15 [config.py:169] Overriding max cuda graph capture size to 1024 for performance.
(APIServer pid=20) INFO 07-07 18:57:15 [vllm.py:977] Asynchronous scheduling is enabled.
(APIServer pid=20) INFO 07-07 18:57:15 [kernel.py:270] Final IR op priority after setting platform defaults: IrOpPriorityConfig(rms_norm=['aiter', 'native'], fused_add_rms_norm=['aiter', 'native'])
(APIServer pid=20) INFO 07-07 18:57:15 [compilation.py:312] Enabled custom fusions: norm_quant, act_quant, rope_kvcache_cat_mla, act_padding, mla_dual_rms_norm, rope_kvcache
(EngineCore pid=657) INFO 07-07 18:57:27 [core.py:112] Initializing a V1 LLM engine (v0.22.0) with config: model='/dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a', speculative_config=None, tokenizer='/dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a', skip_tokenizer_init=False, tokenizer_mode=auto, revision=None, tokenizer_revision=None, trust_remote_code=False, dtype=torch.bfloat16, max_seq_len=9416, download_dir=None, load_format=auto, tensor_parallel_size=1, pipeline_parallel_size=1, data_parallel_size=1, decode_context_parallel_size=1, dcp_comm_backend=ag_rs, disable_custom_all_reduce=False, quantization=gpt_oss_mxfp4, quantization_config=None, enforce_eager=False, enable_return_routed_experts=False, kv_cache_dtype=auto, device_config=cuda, structured_outputs_config=StructuredOutputsConfig(backend='auto', disable_any_whitespace=False, disable_additional_properties=False, reasoning_parser='openai_gptoss', reasoning_parser_plugin='', enable_in_reasoning=False), observability_config=ObservabilityConfig(show_hidden_metrics_for_version=None, otlp_traces_endpoint=None, collect_detailed_traces=None, kv_cache_metrics=False, kv_cache_metrics_sample=0.01, cudagraph_metrics=False, enable_layerwise_nvtx_tracing=False, enable_mfu_metrics=False, enable_mm_processor_stats=False, enable_logging_iteration_details=False), seed=0, served_model_name=/dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a, enable_prefix_caching=False, enable_chunked_prefill=True, pooler_config=None, compilation_config={'mode': <CompilationMode.VLLM_COMPILE: 3>, 'debug_dump_path': None, 'cache_dir': '', 'compile_cache_save_format': 'binary', 'backend': 'inductor', 'custom_ops': ['+rotary_embedding', '+quant_fp8', '+grouped_topk', '+sparse_attn_indexer', 'none'], 'ir_enable_torch_wrap': True, 'splitting_ops': ['vllm::unified_attention_with_output', 'vllm::unified_mla_attention_with_output', 'vllm::mamba_mixer2', 'vllm::mamba_mixer', 'vllm::short_conv', 'vllm::linear_attention', 'vllm::plamo2_mamba_mixer', 'vllm::qwen_gdn_attention_core', 'vllm::gdn_attention_core_xpu', 'vllm::olmo_hybrid_gdn_full_forward', 'vllm::kda_attention', 'vllm::sparse_attn_indexer', 'vllm::rocm_aiter_sparse_attn_indexer', 'vllm::deepseek_v4_attention'], 'compile_mm_encoder': False, 'cudagraph_mm_encoder': False, 'encoder_cudagraph_token_budgets': [], 'encoder_cudagraph_max_vision_items_per_batch': 0, 'encoder_cudagraph_max_frames_per_batch': None, 'compile_sizes': [], 'compile_ranges_endpoints': [256, 8192], 'inductor_compile_config': {'enable_auto_functionalized_v2': False, 'size_asserts': False, 'alignment_asserts': False, 'scalar_asserts': False, 'combo_kernels': True, 'benchmark_combo_kernel': True}, 'inductor_passes': {}, 'cudagraph_mode': <CUDAGraphMode.FULL_AND_PIECEWISE: (2, 1)>, 'cudagraph_num_of_warmups': 1, 'cudagraph_capture_sizes': [1, 2, 4, 8, 16, 24, 32, 40, 48, 56, 64, 72, 80, 88, 96, 104, 112, 120, 128, 136, 144, 152, 160, 168, 176, 184, 192, 200, 208, 216, 224, 232, 240, 248, 256, 272, 288, 304, 320, 336, 352, 368, 384, 400, 416, 432, 448, 464, 480, 496, 512, 528, 544, 560, 576, 592, 608, 624, 640, 656, 672, 688, 704, 720, 736, 752, 768, 784, 800, 816, 832, 848, 864, 880, 896, 912, 928, 944, 960, 976, 992, 1008, 1024], 'cudagraph_copy_inputs': False, 'cudagraph_specialize_lora': True, 'use_inductor_graph_partition': True, 'pass_config': {'fuse_norm_quant': True, 'fuse_act_quant': True, 'fuse_attn_quant': False, 'enable_sp': False, 'fuse_gemm_comms': False, 'fuse_allreduce_rms': False, 'fuse_rope_kvcache_cat_mla': True, 'fuse_act_padding': True, 'fuse_mla_dual_rms_norm': True, 'fuse_rope_kvcache': True}, 'max_cudagraph_capture_size': 1024, 'dynamic_shapes_config': {'type': <DynamicShapesType.BACKED: 'backed'>, 'evaluate_guards': False, 'assume_32_bit_indexing': False}, 'local_cache_dir': None, 'fast_moe_cold_start': True, 'static_all_moe_layers': []}, kernel_config=KernelConfig(ir_op_priority=IrOpPriorityConfig(rms_norm=['aiter', 'native'], fused_add_rms_norm=['aiter', 'native']), enable_flashinfer_autotune=True, moe_backend='auto', linear_backend='auto')
(EngineCore pid=657) INFO 07-07 18:57:27 [parallel_state.py:1422] world_size=1 rank=0 local_rank=0 distributed_init_method=tcp://10.235.26.199:33775 backend=nccl
(EngineCore pid=657) INFO 07-07 18:57:27 [parallel_state.py:1735] rank 0 in world size 1 is assigned as DP rank 0, PP rank 0, PCP rank 0, TP rank 0, EP rank 0, EPLB rank N/A
(EngineCore pid=657) [aiter] import [module_aiter_core] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_aiter_core.so
(EngineCore pid=657) INFO 07-07 18:57:29 [topk_topp_sampler.py:98] Using aiter sampler on ROCm (lazy import, sampling-only).
(EngineCore pid=657) /usr/local/lib/python3.12/dist-packages/vllm/v1/sample/logits_processor/builtin.py:182: UserWarning: expandable_segments not supported on this platform (Triggered internally at /app/pytorch/c10/hip/HIPAllocatorConfig.h:40.)
(EngineCore pid=657)   self.neg_inf_tensor = torch.tensor(
(EngineCore pid=657) INFO 07-07 18:57:29 [gpu_model_runner.py:5037] Starting to load model /dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a...
(EngineCore pid=657) INFO 07-07 18:57:30 [rocm.py:507] Using ROCM_AITER_UNIFIED_ATTN backend (selected via --attention-backend).
(EngineCore pid=657) INFO 07-07 18:57:30 [rocm_aiter_unified_attn.py:132] Using aiter unified attention for RocmAiterUnifiedAttentionImpl
(EngineCore pid=657) INFO 07-07 18:57:30 [mxfp4.py:547] Using 'AITER_MXFP4_BF16' Mxfp4 MoE backend.
(EngineCore pid=657) WARNING 07-07 18:57:30 [compilation.py:1303] Op 'quant_fp8' not present in model, enabling with '+quant_fp8' has no effect
(EngineCore pid=657) WARNING 07-07 18:57:30 [compilation.py:1303] Op 'grouped_topk' not present in model, enabling with '+grouped_topk' has no effect
(EngineCore pid=657) WARNING 07-07 18:57:30 [compilation.py:1303] Op 'sparse_attn_indexer' not present in model, enabling with '+sparse_attn_indexer' has no effect
(EngineCore pid=657) INFO 07-07 18:57:30 [weight_utils.py:922] Filesystem type for checkpoints: TMPFS. Checkpoint size: 60.77 GiB. Available RAM: 2210.91 GiB.
(EngineCore pid=657) INFO 07-07 18:57:30 [weight_utils.py:945] Auto-prefetch is disabled because the filesystem (TMPFS) is not a recognized network FS (NFS/Lustre). If you want to force prefetching, start vLLM with --safetensors-load-strategy=prefetch.
Loading safetensors checkpoint shards:   0% Completed | 0/15 [00:00<?, ?it/s]
Loading safetensors checkpoint shards:   7% Completed | 1/15 [00:00<00:11,  1.18it/s]
Loading safetensors checkpoint shards:  13% Completed | 2/15 [00:01<00:11,  1.17it/s]
Loading safetensors checkpoint shards:  20% Completed | 3/15 [00:02<00:11,  1.06it/s]
Loading safetensors checkpoint shards:  27% Completed | 4/15 [00:03<00:10,  1.02it/s]
Loading safetensors checkpoint shards:  33% Completed | 5/15 [00:04<00:09,  1.03it/s]
Loading safetensors checkpoint shards:  40% Completed | 6/15 [00:05<00:08,  1.07it/s]
Loading safetensors checkpoint shards:  47% Completed | 7/15 [00:06<00:07,  1.08it/s]
Loading safetensors checkpoint shards:  53% Completed | 8/15 [00:07<00:06,  1.11it/s]
Loading safetensors checkpoint shards:  60% Completed | 9/15 [00:08<00:05,  1.11it/s]
Loading safetensors checkpoint shards:  67% Completed | 10/15 [00:09<00:04,  1.13it/s]
Loading safetensors checkpoint shards:  73% Completed | 11/15 [00:10<00:03,  1.13it/s]
Loading safetensors checkpoint shards:  80% Completed | 12/15 [00:10<00:02,  1.14it/s]
Loading safetensors checkpoint shards:  87% Completed | 13/15 [00:11<00:01,  1.16it/s]
Loading safetensors checkpoint shards:  93% Completed | 14/15 [00:12<00:00,  1.13it/s]
Loading safetensors checkpoint shards: 100% Completed | 15/15 [00:13<00:00,  1.13it/s]
Loading safetensors checkpoint shards: 100% Completed | 15/15 [00:13<00:00,  1.11it/s]
(EngineCore pid=657) 
(EngineCore pid=657) INFO 07-07 18:57:44 [default_loader.py:397] Loading weights took 13.67 seconds
(EngineCore pid=657) INFO 07-07 18:57:44 [mxfp4.py:1695] Using MoEPrepareAndFinalizeNoDPEPModular
(EngineCore pid=657) INFO 07-07 18:57:45 [gpu_model_runner.py:5132] Model loading took 68.7 GiB memory and 14.175077 seconds
(EngineCore pid=657) INFO 07-07 18:57:47 [backends.py:1089] Using cache directory: /root/.cache/vllm/torch_compile_cache/ad59666a84/rank_0_0/backbone for vLLM's torch.compile
(EngineCore pid=657) INFO 07-07 18:57:47 [backends.py:1148] Dynamo bytecode transform time: 2.10 s
(EngineCore pid=657) [aiter] import [module_rmsnorm_quant] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_rmsnorm_quant.so
(EngineCore pid=657) [aiter] merge tuned file under model_configs/ and configs/ /usr/local/lib/python3.12/dist-packages/aiter/configs/bf16_tuned_gemm.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/qwen32B_bf16_tuned_gemm.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/gptoss_bf16_tuned_gemm.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/dsv3_bf16_tuned_gemm.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/llama70B_bf16_tuned_gemm.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/llama405B_bf16_tuned_gemm.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/kimik2_bf16_tuned_gemm.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/glm5_bf16_tuned_gemm.csv
(EngineCore pid=657) [aiter] shape is M:5, N:8, K:16 dtype='torch.bfloat16' otype='torch.bfloat16' bias=True, scaleAB=False, bpreshuffle=False, not found tuned config in /tmp/aiter_configs/bf16_tuned_gemm.csv, will use default config! using skinny solution:2
(EngineCore pid=657) [aiter] import [module_custom] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_custom.so
(EngineCore pid=657) INFO 07-07 18:57:58 [backends.py:378] Cache the graph of compile range (1, 256) for later use
(EngineCore pid=657) INFO 07-07 18:57:58 [backends.py:393] Compiling a graph for compile range (1, 256) takes 9.20 s
(EngineCore pid=657) INFO 07-07 18:58:05 [backends.py:378] Cache the graph of compile range (257, 8192) for later use
(EngineCore pid=657) INFO 07-07 18:58:05 [backends.py:393] Compiling a graph for compile range (257, 8192) takes 7.63 s
(EngineCore pid=657) INFO 07-07 18:58:06 [decorators.py:708] saved AOT compiled function to /root/.cache/vllm/torch_compile_cache/torch_aot_compile/752e65b56a9ee1cbf828c0c8a75ef6fc36ece093cc23dd3ab90063c45483be18/rank_0_0/model
(EngineCore pid=657) INFO 07-07 18:58:06 [monitor.py:53] torch.compile took 20.69 s in total
(EngineCore pid=657) [aiter] import [module_rmsnorm] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_rmsnorm.so
(EngineCore pid=657) [aiter] shape is M:8192, N:5120, K:2880 dtype='torch.bfloat16' otype='torch.bfloat16' bias=True, scaleAB=False, bpreshuffle=False, not found tuned config in /tmp/aiter_configs/bf16_tuned_gemm.csv, will use default config! using torch solution:0
(EngineCore pid=657) [aiter] shape is M:8192, N:2880, K:4096 dtype='torch.bfloat16' otype='torch.bfloat16' bias=True, scaleAB=False, bpreshuffle=False, not found tuned config in /tmp/aiter_configs/bf16_tuned_gemm.csv, will use default config! using torch solution:0
(EngineCore pid=657) [aiter] import [module_moe_asm] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_moe_asm.so
(EngineCore pid=657) [aiter] merge tuned file under model_configs/ and configs/ /usr/local/lib/python3.12/dist-packages/aiter/configs/tuned_fmoe.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/gptoss_fp8fp4_tuned_fmoe.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/qwen3_5_397b_fp4_tuned_fmoe.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/dsv3_fp4_tuned_fmoe.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/a8w8_blockscale_tuned_fmoe_glm5.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/minimax_m25_fp4_tuned_fmoe.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/a8w8_blockscale_tuned_fmoe_minimax-m2_5.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/qwen3next_80b_fp8_tuned_fmoe.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/a8w8_blockscale_tuned_fmoe_qwen3_235b.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/kimik2_fp4_tuned_fmoe.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/glm47_fp8_tuned_fmoe.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/a8w8_blockscale_tuned_fmoe_ds_v3.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/a8w8_blockscale_tuned_fmoe_qwen3_5_397b.csv:/usr/local/lib/python3.12/dist-packages/aiter/configs/model_configs/kimik2_fp8fp4_tuned_fmoe.csv
(EngineCore pid=657) [aiter] [fused_moe] using 2stage (kernelName1='flydsl_moe1_afp8_wfp4_bf16_t128x256x256_bnt0_gui_fp8', kernelName2='flydsl_moe2_afp8_wfp4_bf16_t64x256x256_atomic_persist_sbm128') for (256, 8192, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.float8_e4m3fn', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
(EngineCore pid=657) [aiter] import [module_moe_sorting] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_moe_sorting.so
(EngineCore pid=657) INFO 07-07 18:58:13 [monitor.py:81] Initial profiling/warmup run took 7.05 s
(EngineCore pid=657) [aiter] shape is M:1024, N:201088, K:2880 dtype='torch.bfloat16' otype='torch.bfloat16' bias=False, scaleAB=False, bpreshuffle=False, not found tuned config in /tmp/aiter_configs/bf16_tuned_gemm.csv, will use default config! using torch solution:0
(EngineCore pid=657) WARNING 07-07 18:58:15 [topk_topp_sampler.py:201] aiter sampler does not support per-request generators; falling back to PyTorch-native.
(EngineCore pid=657) INFO 07-07 18:58:16 [gpu_worker.py:466] Available KV cache memory: 200.89 GiB
(EngineCore pid=657) INFO 07-07 18:58:16 [kv_cache_utils.py:1733] GPU KV cache size: 3,085,613 tokens
(EngineCore pid=657) INFO 07-07 18:58:16 [kv_cache_utils.py:1734] Maximum concurrency for 9,416 tokens per request: 327.70x
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):   0%|          | 0/83 [00:00<?, ?it/s][aiter] [fused_moe] using 2stage (kernelName1='flydsl_moe1_afp8_wfp4_bf16_t64x256x256_gui_fp8', kernelName2='flydsl_moe2_afp8_wfp4_bf16_t64x256x256_atomic_bnt2') for (256, 1024, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.float8_e4m3fn', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  36%|███▌      | 30/83 [00:04<00:02, 18.82it/s][aiter] [fused_moe] using 2stage (kernelName1='flydsl_moe1_afp8_wfp4_bf16_t32x128x256_w2_gui_fp8', kernelName2='flydsl_moe2_afp8_wfp4_bf16_t32x256x256_atomic_bnt2_persist') for (256, 512, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.float8_e4m3fn', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  57%|█████▋    | 47/83 [00:07<00:02, 13.24it/s][aiter] run_1stage = False, xbf16 = False, ksplit = 0 q_type = QuantType.per_1x32 block_m = 128 use_nt = True, estimated_m_per_expert = 8
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 256, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.float8_e4m3fn', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
(EngineCore pid=657) [aiter] import [module_moe_cktile2stages] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_moe_cktile2stages.so
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  59%|█████▉    | 49/83 [00:08<00:05,  6.04it/s][aiter] run_1stage = False, xbf16 = False, ksplit = 0 q_type = QuantType.per_1x32 block_m = 128 use_nt = True, estimated_m_per_expert = 8
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 256, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  76%|███████▌  | 63/83 [00:09<00:01, 14.93it/s][aiter] run_1stage = False, xbf16 = False, ksplit = 0 q_type = QuantType.per_1x32 block_m = 64 use_nt = True, estimated_m_per_expert = 4
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 128, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  87%|████████▋ | 72/83 [00:10<00:00, 14.82it/s][aiter] run_1stage = False, xbf16 = False, ksplit = 0 q_type = QuantType.per_1x32 block_m = 32 use_nt = True, estimated_m_per_expert = 2
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 64, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  90%|█████████ | 75/83 [00:10<00:00, 10.16it/s][aiter] run_1stage = False, xbf16 = False, ksplit = 0 q_type = QuantType.per_1x32 block_m = 32 use_nt = True, estimated_m_per_expert = 1
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 32, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  93%|█████████▎| 77/83 [00:10<00:00,  9.42it/s][aiter] run_1stage = False, xbf16 = False, ksplit = 0 q_type = QuantType.per_1x32 block_m = 32 use_nt = True, estimated_m_per_expert = 0
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 16, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  95%|█████████▌| 79/83 [00:11<00:00,  7.09it/s][aiter] run_1stage = False, xbf16 = False, ksplit = 0 q_type = QuantType.per_1x32 block_m = 32 use_nt = True, estimated_m_per_expert = 0
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 8, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
(EngineCore pid=657) [aiter] run_1stage = False, xbf16 = False, ksplit = 0 q_type = QuantType.per_1x32 block_m = 32 use_nt = True, estimated_m_per_expert = 0
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 4, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE):  98%|█████████▊| 81/83 [00:12<00:00,  5.35it/s][aiter] run_1stage = False, xbf16 = False, ksplit = 2 q_type = QuantType.per_1x32 block_m = 32 use_nt = True, estimated_m_per_expert = 0
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 2, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
(EngineCore pid=657) [aiter] import [module_activation] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_activation.so
(EngineCore pid=657) [aiter] run_1stage = False, xbf16 = False, ksplit = 3 q_type = QuantType.per_1x32 block_m = 32 use_nt = True, estimated_m_per_expert = 0
(EngineCore pid=657) [aiter] [fused_moe] using 2stage default for (256, 1, 3072, 3072, 128, 4, 'ActivationType.Swiglu', 'torch.bfloat16', 'torch.bfloat16', 'torch.float4_e2m1fn_x2', 'QuantType.per_1x32', True, False) 
Capturing CUDA graphs (mixed prefill-decode, PIECEWISE): 100%|██████████| 83/83 [00:12<00:00,  6.58it/s]
Capturing CUDA graphs (decode, FULL): 100%|██████████| 83/83 [00:06<00:00, 13.27it/s]
(EngineCore pid=657) INFO 07-07 18:58:36 [gpu_model_runner.py:6456] Graph capturing finished in 20 secs, took 6.53 GiB
(EngineCore pid=657) INFO 07-07 18:58:36 [jit_monitor.py:54] Kernel JIT monitor activated — Triton JIT compilations during inference will be logged as warnings.
(EngineCore pid=657) INFO 07-07 18:58:36 [core.py:302] init engine (profile, create kv cache, warmup model) took 51.58 s (compilation: 20.69 s)
(EngineCore pid=657) INFO 07-07 18:58:38 [vllm.py:977] Asynchronous scheduling is enabled.
(EngineCore pid=657) INFO 07-07 18:58:38 [kernel.py:270] Final IR op priority after setting platform defaults: IrOpPriorityConfig(rms_norm=['aiter', 'native'], fused_add_rms_norm=['aiter', 'native'])
(EngineCore pid=657) INFO 07-07 18:58:38 [compilation.py:312] Enabled custom fusions: norm_quant, act_quant, rope_kvcache_cat_mla, act_padding, mla_dual_rms_norm, rope_kvcache
(APIServer pid=20) INFO 07-07 18:58:38 [api_server.py:592] Supported tasks: ['generate']
(APIServer pid=20) WARNING 07-07 18:58:38 [serving.py:220] For gpt-oss, we ignore --enable-auto-tool-choice and always enable tool use.
(APIServer pid=20) INFO 07-07 18:58:40 [hf.py:488] Detected the chat template content format to be 'string'. You can set `--chat-template-content-format` to override this.
(APIServer pid=20) INFO 07-07 18:58:40 [api_server.py:596] Starting vLLM server on http://0.0.0.0:19000
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:37] Available routes are:
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /openapi.json, Methods: GET, HEAD
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /docs, Methods: GET, HEAD
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /docs/oauth2-redirect, Methods: GET, HEAD
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /redoc, Methods: GET, HEAD
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /tokenize, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /detokenize, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /load, Methods: GET
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /version, Methods: GET
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /health, Methods: GET
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /metrics, Methods: GET
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/models, Methods: GET
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /ping, Methods: GET
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /ping, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /invocations, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/chat/completions, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/chat/completions/batch, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/responses, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/responses/{response_id}, Methods: GET
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/responses/{response_id}/cancel, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/completions, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/messages, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/messages/count_tokens, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /inference/v1/generate, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /scale_elastic_ep, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /is_scaling_elastic_ep, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /generative_scoring, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/chat/completions/render, Methods: POST
(APIServer pid=20) INFO 07-07 18:58:40 [launcher.py:46] Route: /v1/completions/render, Methods: POST
(APIServer pid=20) INFO:     Started server process [20]
(APIServer pid=20) INFO:     Waiting for application startup.
(APIServer pid=20) INFO:     Application startup complete.
(APIServer pid=20) INFO:     127.0.0.1:33286 - "GET /health HTTP/1.1" 200 OK
+ [[ -n '' ]]
+ python3 /workspace/utils/bench_serving/benchmark_serving.py --model /dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a --backend vllm --base-url http://0.0.0.0:19000 --dataset-name random --random-input-len 8192 --random-output-len 1024 --random-range-ratio 0.8 --num-prompts 96 --max-concurrency 32 --request-rate inf --ignore-eos --save-result --num-warmups 64 --percentile-metrics ttft,tpot,itl,e2el --result-dir /workspace/ --result-filename gptoss_8192x1024_fp4_vllm_mi355x_tp1-ep1-dpafalse_disagg-false_spec-none_conc32_prompts3x_new.json
Namespace(backend='vllm', base_url='http://0.0.0.0:19000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=32, model='/dev/shm/hf_hub_cache/models--openai--gpt-oss-120b/snapshots/b5c939de8f754692c1647ca79fbf85e8c1e70f8a', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=96, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/workspace/', result_filename='gptoss_8192x1024_fp4_vllm_mi355x_tp1-ep1-dpafalse_disagg-false_spec-none_conc32_prompts3x_new.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='90,99,99.9', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=False, random_num_workers=0, dsv4=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=64)
Generating 96 prompts using 8 worker processes...
  0%|          | 0/64 [00:00<?, ?it/s]Prompt generation completed in 2.4s
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6581  max=8177  mean=7321.12  avg_token_mismatch=0.00  
 output_lens: min=819   max=1024  mean=915.62  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 64 requests...
100%|██████████| 64/64 [00:23<00:00,  2.67it/s]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 96/96 [00:30<00:00,  3.10it/s]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     96        
Benchmark duration (s):                  30.94     
Total input tokens:                      702828    
Total generated tokens:                  87900     
Request throughput (req/s):              3.10      
Output token throughput (tok/s):         2841.20   
Total Token throughput (tok/s):          25558.81  
---------------Time to First Token----------------
Mean TTFT (ms):                          618.48    
Median TTFT (ms):                        198.10    
P90 TTFT (ms):                           1913.33   
P99 TTFT (ms):                           2474.50   
P99.9 TTFT (ms):                         2528.92   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          10.14     
Median TPOT (ms):                        10.26     
P90 TPOT (ms):                           11.33     
P99 TPOT (ms):                           11.78     
P99.9 TPOT (ms):                         11.87     
---------------Inter-token Latency----------------
Mean ITL (ms):                           10.16     
Median ITL (ms):                         8.52      
P90 ITL (ms):                            9.02      
P99 ITL (ms):                            70.15     
P99.9 ITL (ms):                          78.37     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          9909.52   
Median E2EL (ms):                        9793.73   
P90 E2EL (ms):                           12199.94  
P99 E2EL (ms):                           13197.95  
P99.9 E2EL (ms):                         13210.04  
==================================================
+ local benchmark_exit_code=0
+ set +x
[GPU Monitor] Stopped (PID=19)
[GPU Monitor] Collected 1615 rows -> /workspace/gpu_metrics.csv